INSERT INTO task_sections (name, area_id, description) VALUES
('Алгебра', 1, 'Операции и их свойства, уравнения, группы, кольца и поля'),
('Линейная алгебра', 1, 'Векторы, матрицы и линейные преобразования'),
('Геометрия', 1, 'Исследование форм, пространств и взаимного расположения фигур'),
('Математический анализ', 1, 'Пределы, производные, интегралы, ряды и функции'),
('Теория чисел', 1, 'Свойства целых чисел и делимости'),
('Комбинаторика', 1, 'Изучение способов выбора и размещения объектов'),
('Теория вероятности', 1, 'Случайные события, вероятности'),
('Математическая статистика', 1, 'Анализ, интерпретация и представления данных'),
('Математическая логика', 1, 'Формальные системы, доказательства и теория множеств'),
('Дифференциальные уравнения', 1, 'Уравнения, содержащие производные');

INSERT INTO task_sections (name, area_id, description) VALUES
('Информационные технологии', 2, 'Работа с прикладным ПО, управление информацией, офисные инструменты'),
('Теория алгоритмов', 2, 'Построение и анализ алгоритмов'),
('Структуры данных', 2, 'Способы организации и хранения информации'),
('Базы данных', 2, 'Хранение, извлечение и управление данными'),
('Программирование', 2, 'Языки программирования, парадигмы и технологии разработки'),
('Численные методы', 2, 'Вычислительные алгоритмы для решения математических задач');