CALL insert_topic('Дифференциальное исчисление', 'Математический анализ', 'Производные, нахождение максимумов, минимумов, исследования графиков');
CALL insert_topic('Интегральное исчисление', 'Математический анализ', 'Интегралы, нахождение площадей, объёмов');
CALL insert_topic('Пределы и непрерывность', 'Математический анализ', 'Пределы, непрерывности и типы разрывов');
CALL insert_topic('Ряды', 'Математический анализ', 'Бесконечные суммы чисел или функций');
CALL insert_topic('Функции нескольких переменных', 'Математический анализ', 'Частные производные, градиенты, кратные интегралы');
CALL insert_topic('Комплексный анализ', 'Математический анализ', 'Комплексные числа, функции комплексного переменного');

CALL insert_topic('Обыкновенные дифференциальные уравнения', 'Дифференциальные уравнения', 'Обыкновенные дифференциальные уравнения первого, второго и высших порядков, системы уравнений');
CALL insert_topic('Методы решения ОДУ', 'Дифференциальные уравнения', 'Операционный метод (Лапласа), Фурье, Дюамеля и численные методы');
CALL insert_topic('Качественная теория дифференциальных уравнений', 'Дифференциальные уравнения', 'Фазовые портреты, стационарные точки и т.д.');
CALL insert_topic('Дифференциальные уравненияв чатсных производных', 'Дифференциальные уравнения', 'Уравнение теплопроводности, волновое и т.д.');
CALL insert_topic('Прикладные модели', 'Дифференциальные уравнения', 'Колебания, рост популяций, эдектрические цепи, теплоперенос и т.д.');